
# tap repositories and their packages

cask '1password'
cask 'adium'
cask 'alfred'
cask 'android-studio'
cask 'appcode'
cask 'bettertouchtool'
cask 'charles'
cask 'dropbox'
cask 'dterm'
cask 'firefox'
cask 'genymotion'
cask 'google-chrome'
cask 'google-drive'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'mamp'
cask 'mongodb'
cask 'ngrok'
cask 'nocturne'
cask 'path-finder'
cask 'rstudio'
cask 'skype'
cask 'sourcetree'
cask 'spotify'
cask 'unrarx'
cask 'vagrant-manager'
cask 'vagrant'
cask 'virtualbox'

tap 'caskroom/versions'
cask 'java6'
cask 'java7'
cask 'sublime-text'

# Other Homebrew packages
brew 'android-sdk'
brew 'autojump'
brew 'boot2docker'
brew 'chisel'
brew 'docker'
brew 'fasd'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'gradle'
brew 'macvim'
brew 'maven'
brew 'mongodb'
brew 'nmap'
brew 'node'
brew 'npm'
brew 'vcsh'
brew 'vim'
brew 'zsh'

# App Store applications
#appstore Dash
#appstore Graphic
#appstore Kaleidoscope
#appstore Pocket
#appstore Xcode
